# -*- coding:utf-8 -*-

import redis

from Single import Singleton

"""
# --------------------------------------------------
# 作者：Mr.z@<837045534@qq.com>
# --------------------------------------------------
# 描述：爬虫数据库基础操作类
# --------------------------------------------------
# 时间：2017-11-30
# --------------------------------------------------
"""

class Redis(Singleton):
    #.定义链接对象
    dbConn = None
    """
    #####################################################
    # 方法:: Mongo ::__init__
    # ---------------------------------------------------
    # 描述:: 数据库类初始化方法
    # ---------------------------------------------------
    # 参数:
    # param1:in--   Map : config  :: 配置数组
    # ---------------------------------------------------
    # 返回：
    # return:out--  无
    # ---------------------------------------------------
    # 日期:2018.01.12  Add by zwx
    #####################################################
    """
    def __init__(self,config = {}) :
        self.dbConn  = redis.Redis(host=config['redis-Host'], port=config['redis-port'],db=config['redis-db'])
    def Find(cls,key)           : pass
    def Save(cls,key,value,time): pass
    def Exsit(cls,key)          : pass
    def Dtime(cls)              : pass