# -*- coding:utf-8 -*-
import threading
"""
# --------------------------------------------------
# 作者：Mr.z@<837045534@qq.com>
# --------------------------------------------------
# 描述：单例类模版
# --------------------------------------------------
# 时间：2017-11-30
# --------------------------------------------------
"""
class Singleton(type):
    _instanceLock = threading.Lock()
    """
    #####################################################
    # 方法:: Singleton ::__call__
    # --------------------------------------------------
    # 描述:: 数据库单例方法
    # --------------------------------------------------
    # 参数:
    # params:in--   NULL
    # --------------------------------------------------
    # 返回：
    # return:out--  NULL
    # --------------------------------------------------
    # 日期:2018.01.12  Add by zwx
    #####################################################
    """
    def __call__(cls, *args, **kwargs):
        if not hasattr(cls, "_instance") :
            with Singleton._instanceLock :
                if not hasattr(cls, "_instance") :
                    cls._instance = super(Singleton,cls).__call__(*args, **kwargs)
        return cls._instance